CSI API ETABS v1

# cAnalysisResultsSetup Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cAnalysisResultsSetup Setup { get; }

    ReadOnly Property Setup As cAnalysisResultsSetup
    	Get

    Dim instance As cAnalysisResults
    Dim value As cAnalysisResultsSetup

    value = instance.Setup

    property cAnalysisResultsSetup^ Setup {
    	cAnalysisResultsSetup^ get ();
    }

    abstract Setup : cAnalysisResultsSetup with get

#### Property Value

Type: cAnalysisResultsSetup

See Also

#### Reference

cAnalysisResults Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com